print('''
---------------------leo服装店------------------------
-----------------------------------------------------
日期	    服装名称	    价格/件	    库存数量	    销售量/每日
1号	    羽绒服	    253.6	    500             10
2号	    牛仔裤	    86.3	    600	            60
3号	    风衣	        96.8	    335	            43
4号	    皮草      	135.9	    855	            63
5号	    T血	        65.8	    632	            63
6号	    衬衫	        49.3	    562	            120
7号	    牛仔裤	    86.3	    600	            72
8号	    羽绒服	    253.6	    500	            69
9号	    牛仔裤	    86.3	    600	            35
10号	羽绒服	    253.6	    500	            140
11号	牛仔裤	    86.3	    600	            90
12号	皮草	        135.9	    855	            24
13号	T血	        65.8	    632	            45
14号	风衣      	96.8	    335	            25
15号	牛仔裤	    86.3	    600	            60
16号	T血	        65.8	    632	            129
17号	羽绒服	    253.6	    500	            10
18号	风衣	        96.8	    335	            43
19号	T血	        65.8	    632	            63
20号	牛仔裤	    86.3	    600	            60
21号	皮草	        135.9	    855	            63
22号	风衣	        96.8	    335	            60
23号	T血	        65.8	    632	            58
24号	牛仔裤	    86.3	    600	            140
25号	T血	        65.8	    632	            48
26号	风衣	        96.8	    335	            43
27号	皮草	        135.9	    855	            57
28号	羽绒服	    253.6	    500	            10
29号	T血	        65.8	    632	            63
30号	风衣      	96.8	    335	            78
----------------------------------------------------''')
# 羽绒服的总金额
a = (10 + 69 + 140 + 10 + 10) * 253.6
# 牛仔裤的总金额
b = (60 + 72 + 35 + 60 + 60 + 140 + 90) * 86.3
# 风衣的总金额
c = (43 + 25 + 43 + 60 + 43 + 78) * 96.8
# 皮草的总金额
d = (63 + 24 + 63 + 57) * 135.9
# T恤的总金额
e = (63 + 45 + 129 + 63 + 58 + 48 + 63) * 65.8
# 衬衫的总金额
f = 120 * 49.3
# 销售总金额
sum1 = a + b + c + d + e + f

# 羽绒服的总件数
a1 = 10 + 69 + 140 + 10 + 10
# 牛仔裤的总件数
b1 = 60 + 72 + 35 + 60 + 60 + 140 + 90
# 风衣的总件数
c1 = 43 + 25 + 43 + 60 + 43 + 78
# 皮草的总件数
d1 = 63 + 24 + 63 + 57
# T恤的总件数
e1 = 63 + 45 + 129 + 63 + 58 + 48 + 63
# 衬衫的总件数
f1 = 120
# 所有服装的总件数
sum2 = a1 + b1 + c1 + d1 + e1 + f1

print("月销售总额:",round((a + b + c + d + e + f),2), "￥")

print("羽绒服销售件占比:", round(a1 / sum2 * 100, 2), "%")
print("牛仔裤销售件占比:", round(b1 / sum2 * 100, 2), "%")
print("风衣销售件占比:", round(c1 / sum2 * 100, 2), "%")
print("皮草销售件占比:", round(d1 / sum2 * 100, 2), "%")
print("T恤销售件占比:", round(e1 / sum2 * 100, 2), "%")
print("衬衫销售件占比:", round(f1 / sum2 * 100, 2), "%")

print("羽绒服销售额占比:", round(a / sum1 * 100, 2), "%")
print("牛仔裤销售额占比:",  round(b / sum1 * 100, 2), "%")
print("风衣销售额占比:", round(c / sum1 * 100, 2), "%")
print("皮草销售额占比:", round(d / sum1 * 100, 2), "%")
print("T恤销售额占比:", round(e / sum1 * 100, 2), "%")
print("衬衫销售额占比:", round(f / sum1 * 100, 2), "%")


